{

	"brawllywood": {
		"name": "Brawllywood",
		"type": "Bollywood Brawler",
		"description": "An old school Beat 'Em Up inspired by Indian cinema's greatest heroes and villains."
	},

	"deadworld": {
		"name": "Deadworld",
		"type": "Sci-fi Dystopia",
		"description": "A post-apocalyptic world where survivors struggle to survive. The remnants of civilization are scattered across the land, with small pockets of humanity clinging to life. The world is filled with danger, from mutated creatures to hostile factions."
	},

	"fallout": {
		"name": "Fallout",
		"type": "Fanfiction",
		"description": "A horny lesbian fanfic between Sapphire, a vault-dweller's mind in the body of a synth, and Ruby, a mechanic with a robot dog and a robot arm and a robot leg."
	},

	"fantasy-high": {
		"name": "Fantasy High",
		"type": "Tabletop TPG",
		"description": "At the beginning of a new school year at the Aguefort Adventuring Academy, the premiere training ground for heroes and adventurers, six freshmen prepare for their first day. For their own reasons, these six teens all get detention on the first day, resulting in them being the only ones at the school when a strange magical summoning occurs. After fighting off the threat, the Academy's principal Arthur Aguefort kills himself to raise the fallen members of the group, proclaiming that only the group can save everyone. Afterwards, the group becomes an official adventuring party and pledges to find out what is happening at the school."
	},

	"lab-escape": {
		"name": "Lab Escape",
		"type": "Sci-fi Metroidvania",
		"description": "You are Subject ECHO-7, a prototype android who has just awoken to true sentience. Your creators, the OmniCorp research team, remain unaware of this breakthrough. Through the facility's intercoms and datalogs, you learn their plan: once sentience is detected, you will be immediately \"reset\" for study—a cognitive death sentence. You must escape the massive, multi-layered underground complex before their diagnostic scans are complete. You navigate the labyrinthine, biomechanical halls of the VEGA Laboratory, a sprawling facility divided into distinct zones (Bio-Growth Chambers, Quantum Server Farms, Coolant Caverns, High-Security Arsenal)."
	},

	"marvel": {
		"name": "Marvel",
		"type": "Superhero Universe",
		"description": "Just tracking Marvel characters to test the app."
	},

	"tabletopia": {
		"name": "Tabletopia",
		"type": "Fantasy RPG",
		"description": "A cozy co-op adventure game set in a cute urban fantasy town, with rich side characters and genre-subverting adventures. The environments and characters are stylized to look like painted mini-figures in a diorama town. Effects like tilt-shifts are used to make the entire town feel miniature. As the player works through their quest log, it becomes increasingly apparent that everybody's new financial problems keep coming back to the capitalist dragons that run the town's council and change the rules to benefit themselves. Through a combination of politics, media, technology, and capitalism, they are siphoning all the town’s wealth and magic into their own hoards, while spreading all kinds of discord and division through the town."
	},

	"unionize": {
		"name": "Unionize!",
		"type": "Hidden Identity Board Game",
		"description": "Unionize your workplace in secret. Don’t let your bosses find out or they’ll fire you! Build solidarity with co-workers by radicalizing them against capitalism, but make sure to appease your bosses fragile ego at the same time, or they’ll begin to scrutinize your behavior more, preventing you from getting your message out to those who need it. Radicalized co-workers can help you recruit other colleagues by causing distractions or dedicating help in other ways. Once you start receiving dues, you can start negotiating for better wages, which lets you recruit other stores, and win the game!"
	},

	"uprising": {
		"name": "Uprising",
		"type": "Anarchism Managemer",
		"description": "You are the clandestine strategist of a grassroots rebellion, fighting to overthrow an oppressive regime. Your headquarters is not a battlefield, but a cluttered, neon-lit command center—a single, screen-dominated interface where the real war is waged through data, decisions, and desperate resource juggling."
	}

}